import garlicPotato from '~/assets/img/garlic-potato.png';
import lasagna from '~/assets/img/lasagna.png';
import potato from '~/assets/img/potato.png';
import potatoRolls from '~/assets/img/potato-rolls.png';
import puri from '~/assets/img/puri.png';
import tefteli from '~/assets/img/tefteli.png';
import tomYam from '~/assets/img/tom-yam.jpg';
import { CardData } from '~/types/card-data';

export const CARD_DATA: CardData[] = [
    {
        id: 1,
        imgSrc: potato,
        title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
        description:
            'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет  мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
        category: 'Национальные',
        likes: 85,
        favorites: 152,
    },
    {
        id: 2,
        imgSrc: potatoRolls,
        title: 'Картофельные рулетики с грибами',
        description:
            'Рекомендую всем приготовить постное блюдо из картофеля и грибов.  Готовится это блюдо без яиц, без мяса и без сыра, из самых простых  ингредиентов, а получается очень вкусно и сытно. Постный рецепт  картофельных рулетиков с грибами, в томатном соусе, - на обед, ужин и  даже на праздничный стол!',
        category: 'Детские блюда',
        likes: 85,
        favorites: 152,
    },
    {
        id: 3,
        imgSrc: tomYam,
        title: 'Том-ям с капустой кимчи',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: 'Национальные',
        likes: 124,
        favorites: 324,
    },
    {
        id: 4,
        imgSrc: lasagna,
        title: 'Овощная лазанья из лаваша',
        description:
            'Большое, сытное блюдо для ценителей блюд без мяса! Такая лазанья  готовится с овощным соусом и соусом бешамель, а вместо листов для  лазаньи используется тонкий лаваш.',
        category: 'Блюда на гриле',
        likes: 85,
        favorites: 152,
    },
    {
        id: 5,
        imgSrc: tefteli,
        title: 'Тефтели из булгура и чечевицы, запечённые в томатном соусе',
        description:
            'Тефтели из булгура и чечевицы – яркие и питательные, отлично подходят  для постного и вегетарианского меню. Тефтели получаются нежными, а также сочными и ароматными благодаря использованию томатного соуса и душистых пряностей.',
        category: 'Вторые блюда',
        likes: 85,
        favorites: 152,
    },
    {
        id: 6,
        imgSrc: tefteli,
        title: 'Тефтели из булгура и чечевицы, запечённые в томатном соусе',
        description:
            'Тефтели из булгура и чечевицы – яркие и питательные, отлично подходят  для постного и вегетарианского меню. Тефтели получаются нежными, а также сочными и ароматными благодаря использованию томатного соуса и душистых пряностей.',
        category: 'Вторые блюда',
        likes: 85,
        favorites: 152,
    },
    {
        id: 7,
        imgSrc: garlicPotato,
        title: 'Чесночная картошка',
        description:
            'Такая картошечка украсит любой семейный обед! Все будут в полном  восторге, очень вкусно! Аромат чеснока, хрустящая корочка на картошечке - просто объедение! Отличная идея для обеда или ужина, готовится просто!',
        category: 'Национальные',
        likes: 124,
        favorites: 324,
    },
    {
        id: 8,
        imgSrc: puri,
        title: 'Пури',
        description:
            'Пури - это индийские жареные лепешки, которые готовятся из пресного  теста. Рецепт лепешек пури требует самых доступных ингредиентов, и  времени на приготовление хрустящих лепешек уйдет мало.',
        category: 'Национальные',
        likes: 124,
        favorites: 324,
    },
];
