import cabbageCutlet from '~/assets/img/cabbage-cutlet.jpg';
import kefirPancakes from '~/assets/img/kefir-pancake.jpg';
import salad from '~/assets/img/salad.jpg';
import solanka from '~/assets/img/solanka.jpg';
import { CardData } from '~/types/card-data';

export const CAROUSEL_CARD_DATA: CardData[] = [
    {
        id: '1',
        image: solanka,
        title: 'Солянка с грибами',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: ['Первые блюда'],
        bookmarks: 1,
    },
    {
        id: '2',
        image: cabbageCutlet,
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных блюд.',
        category: ['Веганские блюда'],
        bookmarks: 2,
        likes: 1,
    },
    {
        id: '3',
        image: kefirPancakes,
        title: 'Оладьи на кефире "Пышные"',
        description:
            'Очень вкусные и нежные оладьи на кефире. Настоятельно рекомендую пышные кефирные оладьи на завтрак.',
        category: ['Десерты, выпечка'],
        likes: 1,
    },
    {
        id: '4',
        image: salad,
        title: 'Салат "Здоровье"',
        description:
            'Сельдерей очень полезен для здоровья, пора набираться витаминов. Не салат, а сплошное удовольствие:) Вкусный, необычный, а главное быстрый.',
        category: ['Салаты'],
    },
    {
        id: '5',
        image: salad,
        title: 'Салат "Здоровье"',
        description:
            'Сельдерей очень полезен для здоровья, пора набираться витаминов. Не салат, а сплошное удовольствие:) Вкусный, необычный, а главное быстрый.',
        category: ['Салаты'],
    },
    {
        id: '6',
        image: kefirPancakes,
        title: 'Оладьи на кефире "Пышные"',
        description:
            'Очень вкусные и нежные оладьи на кефире. Настоятельно рекомендую пышные кефирные оладьи на завтрак.',
        category: ['Десерты, выпечка'],
        likes: 1,
    },
    {
        id: '7',
        image: solanka,
        title: 'Солянка с грибами',
        description:
            'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        category: ['Первые блюда'],
        bookmarks: 1,
    },
    {
        id: '8',
        image: cabbageCutlet,
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных блюд.',
        category: ['Веганские блюда'],
        bookmarks: 2,
        likes: 1,
    },
    {
        id: '9',
        image: salad,
        title: 'Салат "Здоровье"',
        description:
            'Сельдерей очень полезен для здоровья, пора набираться витаминов. Не салат, а сплошное удовольствие:) Вкусный, необычный, а главное быстрый.',
        category: ['Салаты'],
    },
    {
        id: '10',
        image: cabbageCutlet,
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных блюд.',
        category: ['Веганские блюда'],
        bookmarks: 2,
        likes: 1,
    },
];
