export const PAGE_TITLES = {
    home: {
        title: 'Приятного аппетита!',
    },
    newest: {
        title: 'Новые рецепты',
    },
    vegan: {
        title: 'Веганская кухня',
        subtitle:
            'Интересны не только убеждённым вегетарианцам, но и тем, кто хочет  попробовать вегетарианскую диету и готовить вкусные  вегетарианские блюда.',
    },
    juiciest: {
        title: 'Самое сочное',
    },
    blog: {
        title: 'Кулинарные блоги',
    },
    desserts: {
        title: 'Десерты, выпечка',
        subtitle:
            'Без них невозможно представить себе ни современную, ни традиционную  кулинарию. Пироги и печенья, блины, пончики, вареники и, конечно, хлеб - рецепты изделий из теста многообразны и невероятно популярны.',
    },
};
