export const VEGAN_RELEVANT_CARD_DATA = [
    {
        id: '1',
        title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
        description:
            'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
        category: ['second-dish'],
        bookmarks: 1,
        likes: 1,
    },
    {
        id: '2',
        title: 'Капустные котлеты',
        description:
            'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
        category: ['second-dish'],
        bookmarks: 2,
        likes: 1,
    },
];

export const DESSERTS_RELEVANT_CARD_DATA = [
    {
        id: '1',
        title: 'Бананово-молочное желе',
        description:
            'Молочное желе – это просто, вкусно и полезно, ведь для его приготовления в качестве основы используется молоко.',
        category: ['kid'],
        bookmarks: 1,
        likes: 1,
    },
    {
        id: '2',
        title: 'Нежный сливочно-сырный крем для кексов',
        description:
            'Сливочно-сырным кремом можно украсить кексы, либо другую выпечку, а также этим кремом можно наполнить заварные пирожные.',
        category: ['kid'],
        bookmarks: 2,
        likes: 1,
    },
];
